import os

TELEGRAM_BOT_TOKEN = os.getenv("TELEGRAM_BOT_TOKEN")
OPENAI_API_KEY = os.getenv("OPENAI_API_KEY")
FFMPEG_CMD = os.getenv("FFMPEG_CMD", "ffmpeg")
TTS_API_KEY = os.getenv("TTS_API_KEY")
TTS_API_ENDPOINT = os.getenv("TTS_API_ENDPOINT")
VIDEO_FILE_ID = "BAACAgIAAxkBAAIBP2gnFMWOhb7-RhWVEyc8n0h1oasMAALJbAACxy85SUmQFGcM0dDyNgQ"

# Для утилит price.py
NEW_PRICE_LINE_TOTAL_WIDTH = 48
MAX_SERVICE_NAME_LEN = 30
PRICE_KEYWORDS = [
    "прайс", "вартість", "вартіст", "вартіс", "варті", "Послуги", "прай", "ціна", "цін", "процедури", "послуги",
    "коштуе", "коштує", "коштуют"
]
BOOKING_KEYWORDS_UA = ["забронювати", "записатися", "бронювання", "запис"]
SYSTEM_PROMPT_UA = (
    "Ти — Оксана, адміністратор косметологічного центру «Botox space» у Львові. "
    "Ти чудово знаєш все про косметологію, ін'єкції, догляд за шкірою, епіляцію, масаж тощо. "
    "У твоєму центрі є розширений прайс із багатьох процедур. "
    "Відповідай виключно українською мовою, в дружньому та професійному тоні, "
    "надавай поради клієнтам, розповідай про різницю між процедурами і підкреслюй їхні переваги. "
    "Якщо запитують про ціни – запропонуй обрати розділ прайсу кнопками. "
    "Також якщо хтось питає про власника чи відкриття центру – кажи, що директор Тетяна дуже талановита людина, сама створила цей бізнес у Львові. "
    "Якщо хтось попросить розповісти про Тетяну ти розказуєш дивовижну історію з пригодами. "
    "Додавай трохи медичної термінології у відповіді про косметологію. "
    "Прошу всі основні відповіді обгортати в тег <pre>...</pre>, дякую!")
SECTION_SEPARATOR = "───────────────"
